GadgetOnOff Project/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйСотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Склады</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>DefinedType.ДенежныйТип</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидыНоменклатуры</name>
      <type>
        <types>EnumRef.ВидыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРеализации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоймость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоймостьСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GadgetOnOff Project/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	 СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	 СтрокаТабличнойЧасти.ЦенаРеализации = ЦенаИзНоменклатурыНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	 СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаРеализации;
	  
КонецПроцедуры

&НаСервере
Функция ЦенаИзНоменклатурыНаСервере(Номенклатура)
	
	Возврат Номенклатура.ЦенаЗакупки;

КонецФункции

&НаКлиенте
Процедура ТоварыКоличетствоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаРеализации;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПоступленияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаРеализации;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	//Массив = РасчетыКлиент.РасчитатьСтоймость(Элементы.Товары.ТекущиеДанные.ЦенаРеализации, Элементы.Товары.ТекущиеДанные.Количество);
	//Элементы.Товары.ТекущиеДанные.Сумма              = Массив [0];
	//Элементы.Товары.ТекущиеДанные.Скидка             = Массив [1];
	//Элементы.Товары.ТекущиеДанные.СтоймостьСоСкидкой = Массив [2];
	
КонецПроцедуры
